IDEA Open Model
Stirrup.ShearCheck Property
Compatible with IDEA StatiCa 20.1
 Status of shear check, not possible for detailing stirrup
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public bool ShearCheck { get; set; }
Public Property ShearCheck As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Stirrup Class
IdeaRS.OpenModel.CrossSection Namespace